In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from IPython.display import HTML

%matplotlib inline

In [3]:
# Read and clean data
ref_df = pd.read_csv("../data/UNdata_refugees.csv", skipfooter=3, engine='python')
ref_df = ref_df[["Country or territory of asylum or residence", "Country or territory of origin", 
                      "Year", "Refugees<sup>*</sup>"]]
ref_df = ref_df.rename({"Country or territory of asylum or residence": "asylum", 
                        "Country or territory of origin": "origin", "Refugees<sup>*</sup>": "refugees"}, axis="columns")
ref_df["Year"] = ref_df["Year"].astype(int)

In [4]:
ref_df.head(5)

        asylum                  origin  Year  refugees
0  Afghanistan                    Iraq  2016       1.0
1  Afghanistan    Islamic Rep. of Iran  2016      33.0
2  Afghanistan                Pakistan  2016   59737.0
3      Albania                   China  2016      11.0
4      Albania  Dem. Rep. of the Congo  2016       3.0

In [5]:
ref_df[(ref_df["Year"] == 1975) & (ref_df["origin"] != "Various")]\
    .groupby("origin").sum().sort_values("refugees", ascending=False).head(10)

                        Year  refugees
origin
Angola                  9875  501830.0
Guinea                  1975  300000.0
Rwanda                  9875  175720.0
Burundi                 5925  141940.0
Ethiopia                5925   91410.0
Equatorial Guinea       3950   90000.0
Lao People's Dem. Rep.  1975   55510.0
Guinea-Bissau           1975   46000.0
Dem. Rep. of the Congo  7900   39410.0
Mozambique              5925   34750.0

In [6]:
for x in range(1975, 2017):
    print("*******************", x, "*******************")
    print(ref_df[(ref_df["Year"] == x) & (ref_df["origin"] != "Various")][["origin", "refugees"]]\
                .groupby("origin").sum().sort_values("refugees", ascending=False).head(3)
        )

******************* 1975 *******************
        refugees
origin
Angola  501830.0
Guinea  300000.0
Rwanda  175720.0
******************* 1976 *******************
        refugees
origin
Guinea  500000.0
Angola  499190.0
Rwanda  176410.0
******************* 1977 *******************
                        refugees
origin
Ethiopia                655350.0
Angola                  529830.0
Dem. Rep. of the Congo  264940.0
******************* 1978 *******************
          refugees
origin
Ethiopia  887670.0
Angola    646110.0
Rwanda    175110.0
******************* 1979 *******************
              refugees
origin
Ethiopia     1623870.0
Angola        652980.0
Afghanistan   500000.0
******************* 1980 *******************
              refugees
origin
Ethiopia     2567998.0
Afghanistan  1734921.0
Angola        449030.0
******************* 1981 *******************
              refugees
origin
Afghanistan  3879984.0
Ethiopia     1363266.0
Angola        457060.0
******************* 1982 *******************
              refugees
origin
Afghanistan  4488214.0
Ethiopia     1334915.0
Angola        465891.0
******************* 1983 *******************
              refugees
origin
Afghanistan  4712735.0
Ethiopia     1351917.0
Viet Nam      328399.0
******************* 1984 *******************
              refugees
origin
Afghanistan  4417651.0
Ethiopia     1546134.0
Angola        357821.0
******************* 1985 *******************
              refugees
origin
Afghanistan  4653193.0
Ethiopia     1749309.0
Iraq          401503.0
******************* 1986 *******************
              refugees
origin
Afghanistan  5094283.0
Ethiopia     1534548.0
Iraq          400745.0
******************* 1987 *******************
              refugees
origin
Afghanistan  5511740.0
Ethiopia     1487663.0
Mozambique    635000.0
******************* 1988 *******************
              refugees
origin
Afghanistan  5622982.0
Ethiopia     1513307.0
Mozambique    921238.0
******************* 1989 *******************
              refugees
origin
Afghanistan  5643989.0
Ethiopia     1474919.0
Mozambique   1120758.0
******************* 1990 *******************
              refugees
origin
Afghanistan  6339095.0
Ethiopia     1345928.0
Mozambique   1247992.0
******************* 1991 *******************
              refugees
origin
Afghanistan  6306301.0
Iraq         1321853.0
Mozambique   1316636.0
******************* 1992 *******************
              refugees
origin
Afghanistan  4552153.0
Mozambique   1445474.0
Iraq         1343824.0
******************* 1993 *******************
              refugees
origin
Afghanistan  3374576.0
Mozambique   1172550.0
Burundi       871382.0
******************* 1994 *******************
              refugees
origin
Afghanistan  2731169.0
Rwanda       2257573.0
Liberia       797835.0
******************* 1995 *******************
                         refugees
origin
Afghanistan             2679133.0
Rwanda                  1819366.0
Bosnia and Herzegovina   769753.0
******************* 1996 *******************
                         refugees
origin
Afghanistan             2674236.0
Bosnia and Herzegovina   993868.0
Liberia                  784008.0
******************* 1997 *******************
                         refugees
origin
Afghanistan             2676674.0
Bosnia and Herzegovina   849241.0
Iraq                     707338.0
******************* 1998 *******************
                         refugees
origin
Afghanistan             2667115.0
Iraq                     675030.0
Bosnia and Herzegovina   640075.0
******************* 1999 *******************
                         refugees
origin
Afghanistan             2601691.0
Iraq                     642886.0
Bosnia and Herzegovina   598193.0
******************* 2000 *******************
              refugees
origin
Afghanistan  3587336.0
Burundi       568084.0
Iraq          526179.0
******************* 2001 *******************
              refugees
origin
Afghanistan  3809767.0
Burundi       553999.0
Iraq          530511.0
******************* 2002 *******************
              refugees
origin
Afghanistan  2510294.0
Burundi       574557.0
Sudan         508877.0
******************* 2003 *******************
              refugees
origin
Afghanistan  2136043.0
Sudan         606242.0
Burundi       531637.0
******************* 2004 *******************
              refugees
origin
Afghanistan  2414468.0
Sudan         730641.0
Burundi       485767.0
******************* 2005 *******************
              refugees
origin
Afghanistan  2166149.0
Sudan         693632.0
Burundi       438706.0
******************* 2006 *******************
              refugees
origin
Afghanistan  2107519.0
Iraq         1450905.0
Sudan         686311.0
******************* 2007 *******************
              refugees
origin
Iraq         2279245.0
Afghanistan  1909911.0
Sudan         523032.0
******************* 2008 *******************
              refugees
origin
Iraq         1873519.0
Afghanistan  1817913.0
Somalia       559154.0
******************* 2009 *******************
              refugees
origin
Afghanistan  1905804.0
Iraq         1785212.0
Somalia       678308.0
******************* 2010 *******************
              refugees
origin
Afghanistan  3054709.0
Iraq         1683579.0
Somalia       770152.0
******************* 2011 *******************
              refugees
origin
Afghanistan  2664436.0
Iraq         1428308.0
Somalia      1075148.0
******************* 2012 *******************
              refugees
origin
Afghanistan  2586152.0
Somalia      1136718.0
Iraq          746190.0
******************* 2013 *******************
                   refugees
origin
Afghanistan       2556502.0
Syrian Arab Rep.  2457241.0
Somalia           1121770.0
******************* 2014 *******************
                   refugees
origin
Syrian Arab Rep.  3869626.0
Afghanistan       2596270.0
Somalia           1106434.0
******************* 2015 *******************
                   refugees
origin
Syrian Arab Rep.  4851450.0
Afghanistan       2663005.0
Somalia           1123126.0
******************* 2016 *******************
                   refugees
origin
Syrian Arab Rep.  5500448.0
Afghanistan       2488689.0
South Sudan       1436651.0

In [7]:
for x in range(1975, 2017):
    print("*******************", x, "*******************")
    print(ref_df[(ref_df["Year"] == x) & (ref_df["asylum"] != "Various")][["asylum", "refugees"]]\
                .groupby("asylum").sum().sort_values("refugees", ascending=False).head(3)
        )

******************* 1975 *******************
                        refugees
asylum
United States           530000.0
Dem. Rep. of the Congo  510000.0
Côte d'Ivoire           300000.0
******************* 1976 *******************
                        refugees
asylum
Lebanon                 700000.0
Dem. Rep. of the Congo  515000.0
Côte d'Ivoire           500070.0
******************* 1977 *******************
                        refugees
asylum
Lebanon                 700000.0
United States           684700.0
Dem. Rep. of the Congo  530300.0
******************* 1978 *******************
                        refugees
asylum
United States           734000.0
Dem. Rep. of the Congo  653000.0
Somalia                 600000.0
******************* 1979 *******************
                         refugees
asylum
Somalia                 1175190.0
United States            734000.0
Dem. Rep. of the Congo   710480.0
******************* 1980 *******************
                         refugees
asylum
Somalia                 2000000.0
Pakistan                1428230.0
Dem. Rep. of the Congo   611110.0
******************* 1981 *******************
                       refugees
asylum
Pakistan              2375330.0
Islamic Rep. of Iran  1565000.0
Somalia                700000.0
******************* 1982 *******************
                       refugees
asylum
Pakistan              2877480.0
Islamic Rep. of Iran  1700060.0
Somalia                700000.0
******************* 1983 *******************
                       refugees
asylum
Pakistan              2901360.0
Islamic Rep. of Iran  1900060.0
Somalia                700000.0
******************* 1984 *******************
                       refugees
asylum
Pakistan              2500000.0
Islamic Rep. of Iran  2000000.0
Sudan                  971000.0
******************* 1985 *******************
                       refugees
asylum
Pakistan              2732440.0
Islamic Rep. of Iran  2300000.0
Sudan                 1164000.0
******************* 1986 *******************
                       refugees
asylum
Pakistan              2882100.0
Islamic Rep. of Iran  2590000.0
Sudan                  974200.0
******************* 1987 *******************
                       refugees
asylum
Pakistan              3159000.0
Islamic Rep. of Iran  2760000.0
Somalia                840100.0
******************* 1988 *******************
                       refugees
asylum
Pakistan              3257577.0
Islamic Rep. of Iran  2850000.0
Somalia                834000.0
******************* 1989 *******************
                       refugees
asylum
Pakistan              3275715.0
Islamic Rep. of Iran  2850000.0
Malawi                 822503.0
******************* 1990 *******************
                       refugees
asylum
Islamic Rep. of Iran  4174401.0
Pakistan              3255975.0
Sudan                 1031050.0
******************* 1991 *******************
                       refugees
asylum
Islamic Rep. of Iran  4404995.0
Pakistan              3099891.0
Malawi                 981812.0
******************* 1992 *******************
                       refugees
asylum
Islamic Rep. of Iran  4150723.0
Pakistan              1629218.0
Germany               1236000.0
******************* 1993 *******************
                       refugees
asylum
Islamic Rep. of Iran  2495038.0
Pakistan              1479266.0
Germany               1418000.0
******************* 1994 *******************
                         refugees
asylum
Islamic Rep. of Iran    2236350.0
Dem. Rep. of the Congo  1724365.0
Germany                 1354600.0
******************* 1995 *******************
                         refugees
asylum
Islamic Rep. of Iran    2071988.0
Dem. Rep. of the Congo  1433760.0
Germany                 1267900.0
******************* 1996 *******************
                       refugees
asylum
Islamic Rep. of Iran  2030359.0
Germany               1266000.0
Pakistan              1202703.0
******************* 1997 *******************
                       refugees
asylum
Islamic Rep. of Iran  1982553.0
Pakistan              1202734.0
Germany               1049000.0
******************* 1998 *******************
                       refugees
asylum
Islamic Rep. of Iran  1931332.0
Pakistan              1202462.0
Germany                949200.0
******************* 1999 *******************
                       refugees
asylum
Islamic Rep. of Iran  1835688.0
Pakistan              1202015.0
Germany                975500.0
******************* 2000 *******************
                       refugees
asylum
Pakistan              2001466.0
Islamic Rep. of Iran  1868000.0
Germany                906000.0
******************* 2001 *******************
                       refugees
asylum
Pakistan              2198797.0
Islamic Rep. of Iran  1868000.0
Germany                903000.0
******************* 2002 *******************
                       refugees
asylum
Islamic Rep. of Iran  1306599.0
Pakistan              1227433.0
Germany                980000.0
******************* 2003 *******************
                       refugees
asylum
Pakistan              1124298.0
Islamic Rep. of Iran   984896.0
Germany                960395.0
******************* 2004 *******************
                       refugees
asylum
Pakistan              1290984.0
Islamic Rep. of Iran  1045976.0
Germany                876622.0
******************* 2005 *******************
                       refugees
asylum
Pakistan              1084694.0
Islamic Rep. of Iran   974302.0
Germany                700016.0
******************* 2006 *******************
                       refugees
asylum
Pakistan              1044462.0
Islamic Rep. of Iran   968370.0
United States          843490.0
******************* 2007 *******************
                       refugees
asylum
Syrian Arab Rep.      1503769.0
Islamic Rep. of Iran   963546.0
Pakistan               887273.0
******************* 2008 *******************
                       refugees
asylum
Syrian Arab Rep.      1105698.0
Islamic Rep. of Iran   980109.0
Pakistan               765720.0
******************* 2009 *******************
                       refugees
asylum
Islamic Rep. of Iran  1070488.0
Syrian Arab Rep.      1054466.0
Pakistan               759392.0
******************* 2010 *******************
                       refugees
asylum
Pakistan              1900621.0
Islamic Rep. of Iran  1073366.0
Syrian Arab Rep.      1005472.0
******************* 2011 *******************
                       refugees
asylum
Pakistan              1702700.0
Islamic Rep. of Iran   886468.0
Syrian Arab Rep.       755445.0
******************* 2012 *******************
                       refugees
asylum
Pakistan              1638456.0
Islamic Rep. of Iran   868242.0
Germany                589737.0
******************* 2013 *******************
                       refugees
asylum
Pakistan              1616507.0
Islamic Rep. of Iran   857354.0
Lebanon                856546.0
******************* 2014 *******************
           refugees
asylum
Turkey    1587374.0
Pakistan  1505525.0
Lebanon   1154040.0
******************* 2015 *******************
           refugees
asylum
Turkey    2541352.0
Pakistan  1561162.0
Lebanon   1070854.0
******************* 2016 *******************
           refugees
asylum
Turkey    2869421.0
Pakistan  1352560.0
Lebanon   1012969.0

In [8]:
ref_df[(ref_df["Year"] == 1975) & (ref_df["refugees"] >= 5000) & (ref_df["origin"] != "Various")]

                        asylum                  origin  Year  refugees
95955                  Algeria          Western Sahara  1975   20000.0
95957                Argentina                   Chile  1975   14400.0
95968                  Burundi                  Rwanda  1975   49500.0
95969                 Cameroon       Equatorial Guinea  1975   30000.0
95973                    Congo                  Angola  1975    5000.0
95974            Côte d'Ivoire                  Guinea  1975  300000.0
95975   Dem. Rep. of the Congo                  Angola  1975  460000.0
95976   Dem. Rep. of the Congo                 Burundi  1975   24000.0
95977   Dem. Rep. of the Congo                  Rwanda  1975   24300.0
95982                 Ethiopia                   Sudan  1975   11000.0
95985                    Gabon       Equatorial Guinea  1975   60000.0
96006               Mozambique                  Malawi  1975   30000.0
96008               Mozambique                Zimbabwe  1975   14500.0
96009                    Nepal                Tibetans  1975    8200.0
96015                   Rwanda                 Burundi  1975    7400.0
96016                  Senegal           Guinea-Bissau  1975   46000.0
96020                    Sudan                Ethiopia  1975   91000.0
96024                 Thailand                Cambodia  1975   18830.0
96025                 Thailand  Lao People's Dem. Rep.  1975   55510.0
96033                   Uganda  Dem. Rep. of the Congo  1975   34450.0
96034                   Uganda                  Rwanda  1975   78120.0
96037  United Rep. of Tanzania                 Burundi  1975  110540.0
96040  United Rep. of Tanzania              Mozambique  1975   33700.0
96041  United Rep. of Tanzania                  Rwanda  1975   23100.0
96047                  Various                  Angola  1975    5000.0
96049                   Zambia                  Angola  1975   30040.0

In [9]:
ref_df[ref_df["Year"] == 1975].sort_values("refugees").iloc[-3,:]

asylum      Dem. Rep. of the Congo
origin                      Angola
Year                          1975
refugees                  460000.0
Name: 95975, dtype: object

In [10]:
origin_lst = ref_df[(ref_df["Year"] == 1975) & (ref_df["origin"] != "Various") & (ref_df["asylum"] != "Various")]\
    .groupby("origin").sum().sort_values("refugees", ascending=False).index

In [46]:
display(HTML("<h1>1975 Refugees Origin Countries</h1> (sorted descending)"))
for x in origin_lst:
    value = int(ref_df[(ref_df["Year"] == 1975) & (ref_df["origin"] == x)].groupby("origin").sum()["refugees"][0])
    display(HTML(f"<b>{x} --- {value:15,}</b>"))
    country_ref_df = ref_df[(ref_df["origin"] == x) & (ref_df["Year"] == 1975)]\
          .sort_values("refugees", ascending=False)[["asylum", "refugees"]]
    display(country_ref_df)

                       asylum  refugees
95975  Dem. Rep. of the Congo  460000.0
96049                  Zambia   30040.0
95973                   Congo    5000.0
96047                 Various    5000.0
95962                Botswana    1790.0

              asylum  refugees
95974  Côte d'Ivoire  300000.0

                        asylum  refugees
96034                   Uganda   78120.0
95968                  Burundi   49500.0
95977   Dem. Rep. of the Congo   24300.0
96041  United Rep. of Tanzania   23100.0
95994                    Kenya     700.0

                        asylum  refugees
96037  United Rep. of Tanzania  110540.0
95976   Dem. Rep. of the Congo   24000.0
96015                   Rwanda    7400.0

       asylum  refugees
96020   Sudan   91000.0
95991   Kenya     300.0
96052  Zambia     110.0

         asylum  refugees
95985     Gabon   60000.0
95969  Cameroon   30000.0

         asylum  refugees
96025  Thailand   55510.0

        asylum  refugees
96016  Senegal   46000.0

                        asylum  refugees
96033                   Uganda   34450.0
96019                    Sudan    4500.0
96038  United Rep. of Tanzania     400.0
96051                   Zambia      60.0

                        asylum  refugees
96040  United Rep. of Tanzania   33700.0
95992                    Kenya     600.0
96056                   Zambia     450.0

                        asylum  refugees
96006               Mozambique   30000.0
96055                   Zambia     270.0
96039  United Rep. of Tanzania      80.0

        asylum  refugees
95955  Algeria   20000.0

         asylum  refugees
96024  Thailand   18830.0

          asylum  refugees
95957  Argentina   14400.0
96012       Peru     600.0
95953    Algeria     350.0

                        asylum  refugees
96008               Mozambique   14500.0
95966                 Botswana      80.0
96045  United Rep. of Tanzania      80.0
95997                    Kenya      60.0

         asylum  refugees
95982  Ethiopia   11000.0

      asylum  refugees
96009  Nepal    8200.0

         asylum  refugees
96057    Zambia    3720.0
95964  Botswana     150.0
95993     Kenya     100.0

                        asylum  refugees
96043  United Rep. of Tanzania    2300.0
96060                   Zambia     210.0

            asylum  refugees
96026     Thailand    1420.0
96013  Philippines     690.0

                        asylum  refugees
96059                   Zambia     760.0
95965                 Botswana     190.0
95999                  Lesotho     190.0
95995                    Kenya      90.0
96007               Mozambique      70.0
96042  United Rep. of Tanzania      60.0

                       asylum  refugees
95979  Dem. Rep. of the Congo     750.0

          asylum  refugees
95958  Argentina     570.0

       asylum  refugees
95988  Greece     510.0

       asylum  refugees
96027  Turkey     380.0

         asylum  refugees
95963  Botswana     190.0
96054    Zambia     120.0

       asylum  refugees
96028  Turkey     300.0

        asylum  refugees
96004  Morocco     140.0

        asylum  refugees
96001  Morocco      70.0
96029   Turkey      70.0

       asylum  refugees
96031  Turkey     120.0

       asylum  refugees
96058  Zambia     110.0

       asylum  refugees
96050  Zambia     110.0

       asylum  refugees
96053  Zambia      90.0

          asylum  refugees
95956  Argentina      90.0

        asylum  refugees
96003  Morocco      70.0

       asylum  refugees
96030  Turkey      70.0

        asylum  refugees
96002  Morocco      60.0

        asylum  refugees
96000  Morocco      50.0